In [1]:
# from last class
import pandas as pd

In [5]:
# define data
path = r"../train.csv"
data = pd.read_csv(path)

In [8]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
age = data['Age']

In [13]:
mean_age = age.mean()
mean_age

29.69911764705882

# 29 may 2023
## Retrieving data

### Retrieving column data

In [18]:
# using square brackets 
import numpy as np
wk4 = np.random.rand(3, 5)
df = pd.DataFrame(wk4)
df

          0         1         2         3         4
0  0.340589  0.791655  0.703400  0.754074  0.979491
1  0.341847  0.804157  0.859528  0.658665  0.749259
2  0.458324  0.484436  0.603314  0.581057  0.929949

In [22]:
# retrieve column 3
df.iloc[:,2]

0    0.703400
1    0.859528
2    0.603314
Name: 2, dtype: float64

In [23]:
# retrieve row 2
df.iloc[1,:]

0    0.341847
1    0.804157
2    0.859528
3    0.658665
4    0.749259
Name: 1, dtype: float64

In [25]:
# retrieve row 1 in column 2
df.iloc[0,:1,]

0    0.340589
Name: 0, dtype: float64

### shape and size of data

In [29]:
# shape
# row and column count
df.shape

(3, 5)

In [30]:
# size 
# number of elements
df.size

15

### column data manipultaion

In [31]:
# count elements in a column
col1 = df[1]
col1

0    0.791655
1    0.804157
2    0.484436
Name: 1, dtype: float64

In [32]:
# count elements in the column
col1.count()

3

In [ ]:
# sum of elements in the colu